The initial instance's volume and snapshot details before being deleted …
<img width="1507" height="805" alt="Image" src="https://github.com/user-attachments/assets/2869be7e-1078-45ab-8c47-8dff2364d15d" />
and GitLab pipelines of the deployment after the data volume snapshot was created:
<img width="1483" height="1029" alt="Image" src="https://github.com/user-attachments/assets/6b0c7401-1c4b-404c-a9e9-f2528900a4f7" />
Instance backup…
<img width="1145" height="267" alt="Image" src="https://github.com/user-attachments/assets/33ebe266-7557-4592-9848-93c4af119523" />

Deleted the volume…
<img width="475" height="202" alt="Image" src="https://github.com/user-attachments/assets/52dbc5cc-badf-4138-99ab-72a36c39c007" />

Recreated from backup…
<img width="1428" height="186" alt="Image" src="https://github.com/user-attachments/assets/0993d89c-19de-44a1-82bc-ec5c8669dc28" />

<details>
<summary> Terraform plan and deployment</summary>

```
❯ make -C terraform/gitlab
python /Users/achave11/Pycharm/Azul/stable/azul.stable/scripts/check_branch.py
2025-10-27 13:16:47,446    INFO MainThread __main__: Target branch is 'issues/achave11-ucsc/5224-test-restoration-GL-vol' because it is checked out
set -o pipefail && git ls-files --ignored --others --directory --exclude-standard | (grep -v '/[^/]' || test $? -eq 1) | xargs -r rm -rv
__pycache__/providers.tf.json.template.cpython-313.pyc
__pycache__/common.tf.json.template.cpython-313.pyc
__pycache__/gitlab.tf.json.template.cpython-313.pyc
__pycache__/backend.tf.json.template.cpython-313.pyc
__pycache__/
backend.tf.json
common.tf.json
gitlab.tf.json
providers.tf.json
python -m azul.template providers.tf.json.template.py providers.tf.json
Creating providers.tf.json
python -m azul.template backend.tf.json.template.py backend.tf.json
2025-10-27 13:16:48,767    INFO MainThread botocore.credentials: Found credentials in shared credentials file: ~/.aws/credentials
2025-10-27 13:16:48,804    INFO MainThread azul.deployment: Allocated new Boto3 client for 'iam' with ID 4349053648
2025-10-27 13:16:49,223    INFO MainThread azul.deployment: Allocated new Boto3 client for 'sts' with ID 4350083824
Creating backend.tf.json
terraform init -reconfigure -lockfile=readonly
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Reusing previous version of hashicorp/external from the dependency lock file
- Reusing previous version of hashicorp/null from the dependency lock file
- Reusing previous version of hashicorp/google from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of opensearch-project/opensearch from the dependency lock file
- Using previously-installed hashicorp/null v3.2.0
- Using previously-installed hashicorp/google v4.58.0
- Using previously-installed hashicorp/aws v5.80.0
- Using previously-installed opensearch-project/opensearch v2.2.1
- Using previously-installed hashicorp/external v2.2.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
python -m azul.template common.tf.json.template.py common.tf.json
Creating common.tf.json
python -m azul.template gitlab.tf.json.template.py gitlab.tf.json
2025-10-27 13:16:53,617    INFO MainThread azul.docker: Resolving 'clamav' image TagImageRef(registry='docker.io', username='clamav', repository=('clamav',), tag='1.5.1-6') …
2025-10-27 13:16:53,617    INFO MainThread azul.docker: Resolved 'clamav' image to DigestImageRef(registry='654654270592.dkr.ecr.us-east-1.amazonaws.com', username='docker.io', repository=('clamav', 'clamav'), digest='sha256:c7ec7c6f5cec2ab9db092750fb8a93ef29dae82966eed251df0f2134a164fe13')
2025-10-27 13:16:53,617    INFO MainThread azul.docker: Resolving 'dind' image TagImageRef(registry='docker.io', username='library', repository=('docker',), tag='28.5.1-dind') …
2025-10-27 13:16:53,617    INFO MainThread azul.docker: Resolved 'dind' image to DigestImageRef(registry='654654270592.dkr.ecr.us-east-1.amazonaws.com', username='docker.io', repository=('library', 'docker'), digest='sha256:b175d7f1da70f41d305b92fd1abe8683708c76d4a2f5cadd609c5c395d8b6491')
2025-10-27 13:16:53,617    INFO MainThread azul.docker: Resolving 'gitlab' image TagImageRef(registry='docker.io', username='gitlab', repository=('gitlab-ce',), tag='18.5.1-ce.0') …
2025-10-27 13:16:53,617    INFO MainThread azul.docker: Resolved 'gitlab' image to DigestImageRef(registry='654654270592.dkr.ecr.us-east-1.amazonaws.com', username='docker.io', repository=('gitlab', 'gitlab-ce'), digest='sha256:07bf2c0242e40c4135cd4ce1c68084da92a5ea70ac9ea90bdc25f16e49b0ac04')
2025-10-27 13:16:53,617    INFO MainThread azul.docker: Resolving 'gitlab_runner' image TagImageRef(registry='docker.io', username='gitlab', repository=('gitlab-runner',), tag='ubuntu-v18.5.0') …
2025-10-27 13:16:53,617    INFO MainThread azul.docker: Resolved 'gitlab_runner' image to DigestImageRef(registry='654654270592.dkr.ecr.us-east-1.amazonaws.com', username='docker.io', repository=('gitlab', 'gitlab-runner'), digest='sha256:934fcf26158dd4d2c94fa201a5e6f053f656883c4d2b8b4ed5f8f2027fefc6f8')
2025-10-27 13:16:53,630    INFO MainThread botocore.credentials: Found credentials in shared credentials file: ~/.aws/credentials
2025-10-27 13:16:53,665    INFO MainThread azul.deployment: Allocated new Boto3 client for 'sts' with ID 4453217488
2025-10-27 13:16:53,672    INFO MainThread azul.deployment: Allocated new Boto3 client for 'iam' with ID 4470719552
Creating gitlab.tf.json
terraform validate
Success! The configuration is valid.

python /Users/achave11/Pycharm/Azul/stable/azul.stable/scripts/rename_resources.py
2025-10-27 13:16:56,564    INFO MainThread azul.terraform: Running ['terraform', 'state', 'list']
python /Users/achave11/Pycharm/Azul/stable/azul.stable/scripts/import_default_vpc.py
2025-10-27 13:16:58,464    INFO MainThread __main__: The 'shared' component is not selected, skipping import.
terraform apply
data.aws_region.current: Reading...
data.aws_route53_zone.gitlab: Reading...
aws_cloudwatch_log_group.gitlab_vpc: Refreshing state... [id=/aws/vpc/azul-gitlab]
aws_iam_role.gitlab_vpc: Refreshing state... [id=azul-gitlab_vpc]
aws_iam_service_linked_role.gitlab_ssm: Refreshing state... [id=arn:aws:iam::654654270592:role/aws-service-role/ssm.amazonaws.com/AWSServiceRoleForAmazonSSM]
aws_vpc.gitlab: Refreshing state... [id=vpc-0bc43759f03d1a56e]
aws_cloudwatch_log_group.gitlab_cwagent: Refreshing state... [id=/aws/cwagent/azul-gitlab]
aws_iam_policy.gitlab_vpc: Refreshing state... [id=arn:aws:iam::654654270592:policy/azul-gitlab_vpc]
data.aws_iam_policy_document.gitlab_boundary: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_s3_bucket.logs: Reading...
data.aws_iam_policy_document.gitlab_boundary: Read complete after 0s [id=3822497433]
aws_key_pair.gitlab: Refreshing state... [id=azul-gitlab]
data.aws_sns_topic.monitoring: Reading...
data.aws_iam_policy_document.gitlab_iam: Reading...
data.aws_iam_policy_document.gitlab_iam: Read complete after 0s [id=1122734054]
data.aws_availability_zones.available: Reading...
aws_cloudwatch_log_group.gitlab_vpn: Refreshing state... [id=/aws/vpn/azul-gitlab]
data.aws_acm_certificate.gitlab_vpn: Reading...
data.aws_s3_bucket.logs: Read complete after 0s [id=edu-ucsc-gi-platform-temp-dev-logs.us-east-1]
data.aws_caller_identity.current: Reading...
data.aws_ebs_volume.gitlab: Reading...
aws_iam_role.gitlab: Refreshing state... [id=azul-gitlab]
data.aws_sns_topic.monitoring: Read complete after 0s [id=arn:aws:sns:us-east-1:654654270592:azul-monitoring-tempdev]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
aws_iam_policy.gitlab_boundary: Refreshing state... [id=arn:aws:iam::654654270592:policy/azul-boundary]
data.google_client_config.current: Reading...
data.aws_caller_identity.current: Read complete after 1s [id=654654270592]
google_project_iam_custom_role.gitlab: Refreshing state... [id=projects/platform-temp-dev/roles/azul_gitlab]
aws_inspector2_enabler.gitlab: Refreshing state... [id=654654270592-EC2:ECR]
data.google_client_config.current: Read complete after 1s [id=projects/platform-temp-dev/regions//zones/]
aws_iam_policy.gitlab_iam: Refreshing state... [id=arn:aws:iam::654654270592:policy/azul-gitlab-iam]
aws_cloudwatch_metric_alarm.gitlab_root_disk_use: Refreshing state... [id=azul-gitlab_root_disk_use-tempdev]
data.aws_route53_zone.gitlab: Read complete after 1s [id=Z04642442138A1LKDQC2A]
aws_cloudwatch_metric_alarm.gitlab_data_disk_use: Refreshing state... [id=azul-gitlab_data_disk_use-tempdev]
data.aws_ebs_volume.gitlab: Read complete after 1s [id=vol-02d501bf963665a5d]
aws_cloudwatch_metric_alarm.gitlab_cpu_use: Refreshing state... [id=azul-gitlab_cpu_use-tempdev]
aws_iam_role_policy_attachment.gitlab_vpc: Refreshing state... [id=azul-gitlab_vpc-20240912230442009700000002]
aws_iam_role_policy_attachment.gitlab_ssm_cloudwatch: Refreshing state... [id=azul-gitlab-20240912230442175400000005]
aws_iam_role_policy_attachment.gitlab_ssm: Refreshing state... [id=azul-gitlab-20240912230442168300000004]
aws_iam_instance_profile.gitlab: Refreshing state... [id=azul-gitlab]
aws_iam_role_policy_attachment.gitlab_boundary: Refreshing state... [id=azul-gitlab-20240912230442154600000003]
google_service_account.gitlab: Refreshing state... [id=projects/platform-temp-dev/serviceAccounts/azul-gitlab@platform-temp-dev.iam.gserviceaccount.com]
aws_iam_role_policy_attachment.gitlab_iam: Refreshing state... [id=azul-gitlab-20240912230442196700000006]
google_project_iam_member.gitlab_read: Refreshing state... [id=platform-temp-dev/roles/viewer/serviceAccount:azul-gitlab@platform-temp-dev.iam.gserviceaccount.com]
data.aws_acm_certificate.gitlab_vpn: Read complete after 1s [id=arn:aws:acm:us-east-1:654654270592:certificate/8a4efab9-9f1a-414b-a1b6-80793e3c0817]
google_project_iam_member.gitlab_write: Refreshing state... [id=platform-temp-dev/projects/platform-temp-dev/roles/azul_gitlab/serviceAccount:azul-gitlab@platform-temp-dev.iam.gserviceaccount.com]
aws_subnet.gitlab_public_0: Refreshing state... [id=subnet-0c295f7b9170961f2]
aws_default_security_group.gitlab: Refreshing state... [id=sg-03f7d259a18e0f69f]
aws_subnet.gitlab_private_0: Refreshing state... [id=subnet-058373d0abe3e0bf4]
aws_security_group.gitlab_vpn: Refreshing state... [id=sg-042998d190acbc777]
aws_internet_gateway.gitlab: Refreshing state... [id=igw-0f9ef3ddce28c7c5f]
aws_subnet.gitlab_private_1: Refreshing state... [id=subnet-0b7fc2b0754709036]
aws_lb_target_group.gitlab_git: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:654654270592:targetgroup/azul-gitlab-git/09e8cef576688963]
aws_lb_target_group.gitlab_ssh: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:654654270592:targetgroup/azul-gitlab-ssh/a492c5e237e9f744]
aws_security_group.gitlab: Refreshing state... [id=sg-029ef7cf540c3709e]
aws_lb_target_group.gitlab_http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:654654270592:targetgroup/azul-gitlab-http/44ed374344cd3bb2]
aws_subnet.gitlab_public_1: Refreshing state... [id=subnet-0b939663f7114fbed]
aws_flow_log.gitlab: Refreshing state... [id=fl-0f00c4333a9ff8e42]
aws_security_group.gitlab_alb: Refreshing state... [id=sg-0a4cfb9a413a65d5b]
aws_eip.gitlab_1: Refreshing state... [id=eipalloc-0708c85bd15e751c6]
aws_eip.gitlab_0: Refreshing state... [id=eipalloc-07c3ee0e59c3ee59d]
aws_route.gitlab: Refreshing state... [id=r-rtb-048c5c7b9d474c4731080289494]
aws_ec2_client_vpn_endpoint.gitlab: Refreshing state... [id=cvpn-endpoint-013412e018b9dbb0a]
aws_network_interface.gitlab: Refreshing state... [id=eni-082a1d28ab230cdd0]
aws_ec2_client_vpn_authorization_rule.gitlab: Refreshing state... [id=cvpn-endpoint-013412e018b9dbb0a,172.25.0.0/16]
aws_ec2_client_vpn_network_association.gitlab_0: Refreshing state... [id=cvpn-assoc-02ba9822130bfbd06]
aws_lb.gitlab_nlb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:654654270592:loadbalancer/net/azul-gitlab-nlb/77862775a57dd9a9]
aws_lb.gitlab_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:654654270592:loadbalancer/app/azul-gitlab-alb/b39f5a7cdba49a13]
aws_ec2_client_vpn_network_association.gitlab_1: Refreshing state... [id=cvpn-assoc-021930b3d4d03ddf1]
aws_nat_gateway.gitlab_1: Refreshing state... [id=nat-0a5dc8b6f890403a5]
aws_nat_gateway.gitlab_0: Refreshing state... [id=nat-02c36a30bb71d77c4]
aws_route_table.gitlab_0: Refreshing state... [id=rtb-039aaa81663749e66]
aws_route_table.gitlab_1: Refreshing state... [id=rtb-0d5ade33a9e16aef3]
aws_route_table_association.gitlab_0: Refreshing state... [id=rtbassoc-0e9835e4e6a3c1a9a]
aws_route_table_association.gitlab_1: Refreshing state... [id=rtbassoc-02761d06ea7db90d0]
aws_vpc_endpoint.gitlab_dynamodb: Refreshing state... [id=vpce-0d44056f3eb82d0ea]
aws_vpc_endpoint.gitlab_s3: Refreshing state... [id=vpce-0bc20645875df5011]
aws_lb_listener.gitlab_git: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:654654270592:listener/net/azul-gitlab-nlb/77862775a57dd9a9/630394f734ddb769]
aws_route53_record.gitlab_ssh: Refreshing state... [id=Z04642442138A1LKDQC2A_ssh.gitlab.temp.gi.ucsc.edu_A]
aws_lb_listener.gitlab_ssh: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:654654270592:listener/net/azul-gitlab-nlb/77862775a57dd9a9/4b0537cefe7afccd]
aws_route53_record.gitlab: Refreshing state... [id=Z04642442138A1LKDQC2A_gitlab.temp.gi.ucsc.edu_A]
aws_route53_record.gitlab_docker: Refreshing state... [id=Z04642442138A1LKDQC2A_docker.gitlab.temp.gi.ucsc.edu_A]
aws_instance.gitlab: Refreshing state... [id=i-0518dc758f745b72c]
aws_acm_certificate.gitlab: Refreshing state... [id=arn:aws:acm:us-east-1:654654270592:certificate/72b06405-5754-48ae-b14b-2b8c149ddde9]
aws_lb_target_group_attachment.gitlab_http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:654654270592:targetgroup/azul-gitlab-http/44ed374344cd3bb2-20251024222514809800000002]
aws_lb_target_group_attachment.gitlab_ssh: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:654654270592:targetgroup/azul-gitlab-ssh/a492c5e237e9f744-20251024222514872500000004]
aws_volume_attachment.gitlab: Refreshing state... [id=vai-3984772372]
aws_lb_target_group_attachment.gitlab_git: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:654654270592:targetgroup/azul-gitlab-git/09e8cef576688963-20251024222514852800000003]
aws_route53_record.gitlab_validation["docker.gitlab.temp.gi.ucsc.edu"]: Refreshing state... [id=Z04642442138A1LKDQC2A__e14e8ff597d86a414447fc812169b9d6.docker.gitlab.temp.gi.ucsc.edu._CNAME]
aws_route53_record.gitlab_validation["gitlab.temp.gi.ucsc.edu"]: Refreshing state... [id=Z04642442138A1LKDQC2A__40b962825fb5186b80cde733b60f3043.gitlab.temp.gi.ucsc.edu._CNAME]
aws_lb_listener.gitlab_http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:654654270592:listener/app/azul-gitlab-alb/b39f5a7cdba49a13/22e67718f14afb86]
aws_acm_certificate_validation.gitlab: Refreshing state... [id=2025-10-07 21:17:42.52 +0000 UTC]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last
"terraform apply" which may have affected this plan:

  # aws_instance.gitlab has been deleted
  - resource "aws_instance" "gitlab" {
      - id                                   = "i-0518dc758f745b72c" -> null
        tags                                 = {
            "Name"                = "azul-gitlab"
            "Owner"               = "hannes@ucsc.edu"
            "billing"             = "anvil"
            "component"           = "azul-gitlab"
            "deployment"          = "tempdev"
            "owner"               = "hannes@ucsc.edu"
            "service"             = "azul"
            "terraform_component" = "gitlab"
        }
        # (40 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include actions to
undo or respond to these changes.

────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.gitlab will be created
  + resource "aws_instance" "gitlab" {
      + ami                                  = "ami-0ce4ea729be281b05"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "azul-gitlab"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3a.xlarge"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "azul-gitlab"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"                = "azul-gitlab"
          + "Owner"               = "hannes@ucsc.edu"
          + "billing"             = "anvil"
          + "component"           = "azul-gitlab"
          + "deployment"          = "tempdev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "gitlab"
        }
      + tags_all                             = {
          + "Name"                = "azul-gitlab"
          + "Owner"               = "hannes@ucsc.edu"
          + "billing"             = "anvil"
          + "component"           = "azul-gitlab"
          + "deployment"          = "tempdev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "gitlab"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "fb68bddf69a0b8ad2d425ef34c0c1e5a8bec6efd"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = true
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 3
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = false
          + device_index          = 0
          + network_card_index    = 0
          + network_interface_id  = "eni-082a1d28ab230cdd0"
        }

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 20
          + volume_type           = (known after apply)
        }
    }

  # aws_lb_target_group_attachment.gitlab_git will be created
  + resource "aws_lb_target_group_attachment" "gitlab_git" {
      + id               = (known after apply)
      + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:654654270592:targetgroup/azul-gitlab-git/09e8cef576688963"
      + target_id        = (known after apply)
    }

  # aws_lb_target_group_attachment.gitlab_http will be created
  + resource "aws_lb_target_group_attachment" "gitlab_http" {
      + id               = (known after apply)
      + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:654654270592:targetgroup/azul-gitlab-http/44ed374344cd3bb2"
      + target_id        = (known after apply)
    }

  # aws_lb_target_group_attachment.gitlab_ssh will be created
  + resource "aws_lb_target_group_attachment" "gitlab_ssh" {
      + id               = (known after apply)
      + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:654654270592:targetgroup/azul-gitlab-ssh/a492c5e237e9f744"
      + target_id        = (known after apply)
    }

  # aws_volume_attachment.gitlab will be created
  + resource "aws_volume_attachment" "gitlab" {
      + device_name = "/dev/sdf"
      + id          = (known after apply)
      + instance_id = (known after apply)
      + volume_id   = "vol-02d501bf963665a5d"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_instance.gitlab: Creating...
aws_instance.gitlab: Still creating... [00m10s elapsed]
aws_instance.gitlab: Creation complete after 15s [id=i-0edb8045b38fa3a83]
aws_lb_target_group_attachment.gitlab_ssh: Creating...
aws_lb_target_group_attachment.gitlab_git: Creating...
aws_lb_target_group_attachment.gitlab_http: Creating...
aws_volume_attachment.gitlab: Creating...
aws_lb_target_group_attachment.gitlab_http: Creation complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:654654270592:targetgroup/azul-gitlab-http/44ed374344cd3bb2-20251027202426735700000002]
aws_lb_target_group_attachment.gitlab_ssh: Creation complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:654654270592:targetgroup/azul-gitlab-ssh/a492c5e237e9f744-20251027202426765700000003]
aws_lb_target_group_attachment.gitlab_git: Creation complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:654654270592:targetgroup/azul-gitlab-git/09e8cef576688963-20251027202426821100000004]
aws_volume_attachment.gitlab: Still creating... [00m10s elapsed]
aws_volume_attachment.gitlab: Still creating... [00m20s elapsed]
aws_volume_attachment.gitlab: Creation complete after 22s [id=vai-2506845085]

Apply complete! Resources: 5 added, 0 changed, 0 destroyed.
```
</details>

Instance attached to volume and …
<img width="1373" height="567" alt="Image" src="https://github.com/user-attachments/assets/2695c35d-ac03-4850-938d-dc73a3d52ebc" />

GitLab pipelines…
<img width="1429" height="1027" alt="Image" src="https://github.com/user-attachments/assets/3022efae-00a5-4310-9154-3b8508fbf31a" />